** Packaging up new two-d PDF figures to send to jane
#+BEGIN_SRC sh :tangle zip-figs-for-jane.sh :results verbatim
  FILES="hist-vmean-sig-00[12]5-[ON][23]*.pdf obs-combo-hist-vmean-sig.pdf obs-combo-hist-vpeak-fwhm.pdf ABC-profile-example.pdf"
  ZIPFILE=new-figs-2016-06-22.zip
  ls -l $FILES
  zip $ZIPFILE $FILES
#+END_SRC

#+RESULTS:
#+begin_example
-rw-r--r--@ 1 will  staff  327936 Jun 22 09:07 ABC-profile-example.pdf
-rw-r--r--@ 1 will  staff   51426 Jun 22 07:56 hist-vmean-sig-0015-N26584.pdf
-rw-r--r--@ 1 will  staff   45134 Jun 22 07:55 hist-vmean-sig-0015-O35007.pdf
-rw-r--r--@ 1 will  staff   44712 Jun 22 08:01 hist-vmean-sig-0025-N26584.pdf
-rw-r--r--@ 1 will  staff   42453 Jun 22 07:53 hist-vmean-sig-0025-O35007.pdf
-rw-r--r--@ 1 will  staff   34295 Jun 22 08:12 obs-combo-hist-vmean-sig.pdf
-rw-r--r--@ 1 will  staff   38597 Jun 22 08:15 obs-combo-hist-vpeak-fwhm.pdf
  adding: hist-vmean-sig-0015-N26584.pdf (deflated 27%)
  adding: hist-vmean-sig-0015-O35007.pdf (deflated 30%)
  adding: hist-vmean-sig-0025-N26584.pdf (deflated 31%)
  adding: hist-vmean-sig-0025-O35007.pdf (deflated 32%)
  adding: obs-combo-hist-vmean-sig.pdf (deflated 36%)
  adding: obs-combo-hist-vpeak-fwhm.pdf (deflated 34%)
  adding: ABC-profile-example.pdf (deflated 8%)
#+end_example

** Packaging them up to send to jane
#+BEGIN_SRC sh :tangle zip-figs-for-jane.sh :results verbatim
  FILES="bright-hist-obs.pdf obs-stats-plot.pdf sim-stats-plot.pdf pos-stats-evo-O35007.pdf strucfunc-ideal.pdf ABC-profile-example.pdf"
  ZIPFILE=new-figs-2016-06-17.zip
  ls -l $FILES
  zip $ZIPFILE $FILES
#+END_SRC

#+RESULTS:
#+begin_example
-rw-r--r--@ 1 will  staff  282010 Jun 17 10:33 ABC-profile-example.pdf
-rw-r--r--@ 1 will  staff   34470 Jun 17 08:54 bright-hist-obs.pdf
-rw-r--r--@ 1 will  staff   33360 Jun 17 09:43 obs-stats-plot.pdf
-rw-r--r--@ 1 will  staff   35171 Jun 17 09:49 pos-stats-evo-O35007.pdf
-rw-r--r--@ 1 will  staff   37768 Jun 17 09:45 sim-stats-plot.pdf
-rw-r--r--@ 1 will  staff   28251 Jun 17 09:53 strucfunc-ideal.pdf
  adding: bright-hist-obs.pdf (deflated 33%)
  adding: obs-stats-plot.pdf (deflated 42%)
  adding: sim-stats-plot.pdf (deflated 36%)
  adding: pos-stats-evo-O35007.pdf (deflated 33%)
  adding: strucfunc-ideal.pdf (deflated 44%)
  adding: ABC-profile-example.pdf (deflated 9%)
#+end_example

* Plane of sky versus line of sight velocity dispersion
:LOGBOOK:
CLOCK: [2016-04-11 Mon 10:41]--[2016-04-11 Mon 23:19] => 12:38
:END:
+ In the Orion slit data, we see a strange thing:
  + The plane-of-sky variance in mean velocity is \sigma^2 \approx 10 km^2/s^2 \to \sigma \approx 3 km/s
  + The line-of-sight velocity variance from linewidth is \sigma^2 \approx 80 km^2/s^2 \to \sigma \approx 9 km/s
    + This is even after taking of generous estimates of the instrumental and thermal widths
  + In summary: *Line-of-sight velocity variations \gg plane-of-sky velocity variations*
+ So the questions are:
  1. Why is that?
  2. Do we see anything similar in our simulations?
** Calculate PDF of surface brightness
First simulations
#+name: emissivity-variation-sim
#+header: :var EMLINE="O35007" TIME=30
#+BEGIN_SRC python :results output
  import numpy as np
  from matplotlib import pyplot as plt
  from matplotlib.colors import PowerNorm
  import seaborn as sns
  from astropy.io import fits

  TEMPLATE = '04052012_4_{:04d}vsum-{}-{}.fits'
  VIEWS = ['xn', 'xp', 'yn', 'yp', 'zn', 'zp']
  LABELS = {
      'xn': '$-x$', 'xp': '$+x$',
      'yn': '$-y$', 'yp': '$+y$',
      'zn': '$-z$', 'zp': '$+z$',
      'O35007': '[O III] $\lambda$5007', 'N26584': '[N II] $\lambda$6583', 
      }
  for vv in VIEWS:
      fn = TEMPLATE.format(TIME, vv, EMLINE)
      s = fits.open(fn)[0].data.ravel()
      mean = s.mean()
      sig = s.std()
      sigw = np.sqrt(np.average((s-mean)**2, weights=s))
      print(EMLINE, TIME, vv, sig/mean, np.std(np.log10(s)), sigw/mean)

#+END_SRC

#+RESULTS: emissivity-variation
: O35007 30 xn 1.7109 1.58125 3.74926
: O35007 30 xp 1.238 1.71702 2.03549
: O35007 30 yn 1.66927 2.2803 3.25964
: O35007 30 yp 1.15266 1.70701 1.78502
: O35007 30 zn 1.23039 2.13863 2.14974
: O35007 30 zp 1.48446 2.17644 2.88916

+ This is far too large - but that is not surprising since the brightness has a very large gradient
+ We should maybe do a radial detrending first

But first, we will try it with th eobservations

#+name: emissivity-variation-obs
#+BEGIN_SRC python :results file :return plotfile
  import sys
  import numpy as np
  from matplotlib import pyplot as plt
  from matplotlib.colors import PowerNorm
  import seaborn as sns
  from astropy.io import fits
  from astropy.modeling import models, fitting
  sys.path.append('/Users/will/Work/RubinWFC3/Tsquared')
  from rebin_utils import downsample, oversample

  plotfile = 'bright-hist-obs.pdf'
  EMLINES = ['siil', 'nii', 'ha', 'oiii']
  DATASET = {'siil': 'spm', 'siis': 'spm',
             'siii': 'spm', 'oi': 'spm',
             'ha': 'kpno', 'nii': 'kpno', 'oiii': 'kpno'}
  TEMPLATES = {
      'kpno': '/Users/will/Work/BobKPNO/DOH{}_-040+070.wisomom-sum-xx.fits',
      'spm': '/Users/will/Work/BobKPNO/newmapas/{}_-040+070.wisomom-sum-smooth2d.fits'
  }
  LABELS = {
      'oiii': r'[O III] $\lambda$5007',
      'nii': r'[N II] $\lambda$6583',
      'ha': r'H$\alpha$ $\lambda$6563',
      'siil': r'[S II] $\lambda$6731',
      'siis': r'[S II] $\lambda$6716',
      'siii': r'[S III] $\lambda$6312',
      'oi': r'[O I] $\lambda$6300',
  }

  sns.set_style('whitegrid')
  sns.set_context('talk')
  sns.set_color_codes("deep")
  whitebox = {'facecolor': 'white', 'alpha': 0.7, 'edgecolor': 'none'}
  fitter = fitting.LevMarLSQFitter()
  fig, axes = plt.subplots(2, 2, sharex=True, sharey=True)
  fig.set_size_inches(6, 4)
  for emline, ax in zip(EMLINES, axes.flat):
      fn = TEMPLATES[DATASET[emline]].format(emline)
      s = fits.open(fn)[0].data
      m = (s > 0.0) & np.isfinite(s)
      s /= np.mean(s[m])
      w = np.ones_like(s)
      for n in [2, 4, 8, 16]:
          [s,], m, w = downsample([s,], m, weights=w, mingood=1)

      #ax.hist(s, bins=100, range=[0.0, 5.0], weights=s)
      H, edges, patches = ax.hist(np.log(s[m]), weights=s[m],
                                  normed=True, bins=25, range=[-2.1, 2.1])
      # Calculate bin centers
      x = 0.5*(edges[:-1] + edges[1:])
      # Fit Gaussian 
      g = models.Gaussian1D(amplitude=H.max(), stddev=0.5)
      core = H > 0.3*H.max()
      g = fitter(g, x[core], H[core])
      xx = np.linspace(-2.1, 2.1, 200)
      ax.plot(xx, g(xx), 'orange', lw=2)
      # Calculate equivalent fractional RMS width in linear brightness space
      X = np.exp(xx)
      Xmean = np.average(X, weights=g(xx))
      Xvariance = np.average((X - Xmean)**2, weights=g(xx))
      eps_rms = np.sqrt(Xvariance)/Xmean
      ax.set_xlim(-2.3, 2.3)
      ax.set_ylim(-0.05, 1.05)
      biglabel = (LABELS[emline]
                  + '\n' + r'$\sigma_{\ln(S/S_0)} '
                  + '= {:.2f}$'.format(g.stddev.value))
      ax.text(-2.2, 0.8, biglabel, bbox=whitebox, fontsize='small')
  axes[-1, 0].set_xlabel(r'Surface brightness: $\ln\, (S / S_0)$')
  axes[-1, 0].set_ylabel('Probability density')
  fig.tight_layout()
  fig.savefig(plotfile)

#+END_SRC

#+RESULTS: emissivity-variation-obs
[[file:bright-hist-obs.pdf]]

*** Make files for Jane to calculate structure function
+ We want the velocity of component A, but with a mask applied
+ And expanded in x to give square pixels

#+BEGIN_SRC python
  from astropy.io import fits
  import numpy as np

  hdu, = fits.open('oiii-3G-vmean_A.fits')

  m = np.isfinite(hdu.data) & (hdu.data > 15.01) & (hdu.data < 34.99)

  # Apply mask directly
  hdu.data[~m] = -999.0

  # Pad out by factor of 4 in x
  hdu.data = np.kron(hdu.data, np.ones((1, 4)))

  hdu.writeto('oiii-component-A-centroid.fits', clobber=True)


#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC sh :results verbatim
rsync -avzP oiii-component-A-centroid.fits magneton:/fs/magneton/other0/will
#+END_SRC

#+RESULTS:
: sending incremental file list
: oiii-component-A-centroid.fits
:           1,256   0%    0.00kB/s    0:00:00        1,584,000 100%   36.82MB/s    0:00:00 (xfr#1, to-chk=0/1)
: 
: sent 249,535 bytes  received 7,610 bytes  11,428.67 bytes/sec
: total size is 1,584,000  speedup is 6.16

** What would the wind do?
:LOGBOOK:
CLOCK: [2016-04-11 Mon 23:19]--[2016-04-12 Tue 08:18] =>  8:59
:END:
+ We see clear evidence of difference betwen the observed and simulation results
+ The observations have larger sigma, and also more negative [O III]
+ In addition, in the observations, sigma tends to increase for negative ubar
  + Which is seldom seen in the simmulations
  + Usually they show the opposite
+ [ ] What about the analytic calculation of the wind cavity?
  + We could repat the calculations, but with the middle bit removed



** And what about the scattering?
:LOGBOOK:
CLOCK: [2016-04-12 Tue 08:18]--[2016-04-12 Tue 08:47] =>  0:29
:END:
+ LOS sigma increases with blueshift in the observations
+ This is exactly what is expected for back-scattering!
  + Larger blueshifts of direct component should produce larger redshifts of the scattered component
+ And is the opposite of what we see in the simulations
+ We can simulate this
  + The direct velocity is u
  + Assume that a certain fraction A is back-scattered with velocity u' = - B u
    + Where B is a constant between 0 and 1 (depends on mean scattering angle)
    + And this only applies to u < 0, since u > 0 will mainly suffer foreground scattering, not background
  + Then work out change to total ubar and \sigma
    + Assume the broadening adds in quadrature
    + It will reduce ubar a bit (hopefully not much)
    + And it will increase sigma (hopefully by a lot)

 


** [S III] velocity dispersion
|        |    V |
|--------+------|
|        | 19.5 |
|        | 24.0 |
|        | 21.1 |
|        | 21.0 |
|        | 19.0 |
|        | 23.8 |
|        | 19.7 |
|        | 17.6 |
|        | 20.0 |
|        | 18.5 |
|        | 15.3 |
|        | 18.6 |
|        | 20.6 |
|        | 15.2 |
|        | 14.1 |
|        | 19.8 |
|        | 12.9 |
|        | 13.9 |
|        | 19.0 |
|        | 20.1 |
|        | 20.8 |
|        | 17.1 |
|        | 19.5 |
|        | 15.4 |
|        | 16.0 |
|        | 23.5 |
|        | 22.8 |
|        | 20.1 |
|        | 20.8 |
|        | 20.9 |
|        | 19.1 |
|        | 15.2 |
|        | 14.0 |
|        | 12.7 |
|        | 11.0 |
|        | 14.7 |
|        | 25.0 |
|        | 25.2 |
|        | 22.4 |
|        | 22.1 |
|        | 16.7 |
|        | 14.4 |
|        | 14.6 |
|        | 12.1 |
|        | 10.4 |
|        | 24.3 |
|        | 23.0 |
|        | 21.8 |
|        | 18.3 |
|        | 18.5 |
|        | 18.3 |
|        | 12.8 |
|        | 24.3 |
|        | 19.6 |
|        | 14.1 |
|        | 15.3 |
|        | 16.0 |
|        | 18.9 |
|        | 18.1 |
|        | 17.5 |
|        | 16.0 |
|--------+------|
| Mean   | 18.3 |
| stddev | 3.68 |
| var    | 13.8 |
#+TBLFM: @63$2=vmean(@I..@II);f1::@64$2=vpsdev(@I..@II);f2::@65$2=vvar(@I..@II);f1



** [O I] velocity dispersion
|        |    V |
|--------+------|
|        | 25.0 |
|        | 26.8 |
|        | 26.3 |
|        | 25.2 |
|        | 24.9 |
|        | 25.9 |
|        | 25.7 |
|        | 24.7 |
|        | 24.2 |
|        | 24.5 |
|        | 22.3 |
|        | 24.1 |
|        | 24.2 |
|        | 26.0 |
|        | 26.0 |
|        | 26.5 |
|        | 24.8 |
|        | 23.4 |
|        | 27.0 |
|        | 25.4 |
|        | 25.5 |
|        | 27.2 |
|        | 27.3 |
|        | 27.9 |
|        | 27.6 |
|        | 25.5 |
|        | 27.4 |
|        | 27.3 |
|        | 26.6 |
|        | 27.2 |
|        | 27.7 |
|        | 26.5 |
|        | 26.4 |
|        | 25.3 |
|        | 25.3 |
|        | 26.2 |
|        | 25.3 |
|        | 27.7 |
|        | 28.4 |
|        | 26.6 |
|        | 27.6 |
|        | 26.7 |
|        | 24.7 |
|        | 23.8 |
|        | 23.9 |
|        | 25.7 |
|        | 27.7 |
|        | 28.7 |
|        | 28.6 |
|        | 27.0 |
|        | 25.2 |
|        | 25.7 |
|        | 23.2 |
|        | 28.4 |
|        | 26.0 |
|        | 24.5 |
|        | 23.1 |
|        | 24.6 |
|        | 26.0 |
|        | 25.5 |
|        | 25.0 |
|        | 25.2 |
|--------+------|
| Mean   | 25.9 |
| Stddev | 1.45 |
| Var    |  2.1 |
#+TBLFM: @64$2=vmean(@I..@II);f1::@65$2=vpsdev(@I..@II);f2::@66$2=vvar(@I..@II);f1



Look at differences between top and bottom 1/3, separated by about 100''

 
| Vtop | Vbot |     dV |  dV^2 |
|------+------+--------+------|
| 25.0 | 27.7 |   -2.7 |  7.3 |
| 26.8 | 28.7 |   -1.9 |  3.6 |
| 26.3 | 28.6 |   -2.3 |  5.3 |
| 25.2 | 27.0 |   -1.8 |  3.2 |
| 24.9 | 25.2 |   -0.3 | 9e-2 |
| 25.9 | 25.7 |    0.2 | 4e-2 |
| 25.7 | 23.2 |    2.5 |  6.3 |
| 24.7 | 28.4 |   -3.7 | 13.7 |
| 24.2 | 26.0 |   -1.8 |  3.2 |
| 24.5 | 24.5 |     0. |  0.0 |
| 22.3 | 23.1 |   -0.8 |  0.6 |
| 24.1 | 24.6 |   -0.5 |  0.3 |
| 24.2 | 26.0 |   -1.8 |  3.2 |
| 26.0 | 25.5 |    0.5 |  0.3 |
| 26.0 | 25.0 |     1. |  1.0 |
| 26.5 | 25.2 |    1.3 |  1.7 |
| 24.8 | 27.7 |   -2.9 |  8.4 |
| 23.4 | 28.7 |   -5.3 | 28.1 |
|------+------+--------+------|
|      |      |   Mean |  4.8 |
|      |      | Median |  3.2 |
#+TBLFM: $3=$1 - $2::$4=$-1**2;f1::@20$3=Mean::@20$4=vmean(@I..@II);f1::@21$3=Median::@21$4=vmedian(@I..@II);f1


+ Do I really want to do this?


